mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
/* TFT module
 *
 *  Author: LoBo (loboris@gmail.com, loboris.github)
 *
 *  Module supporting SPI TFT displays based on ILI9341 & ILI9488 controllers
*/

#include <stdio.h>
#include <errno.h>
#include <sys/stat.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"

#include "time.h"
#include <math.h>
#include "rom/tjpgd.h"
#include "esp_heap_caps.h"





#include <ProjectConfig.h>
#include <esp8266.h>
#include <Platform.h>

// the Smart-Connected-Device-Engine structures & types ..
#include <SCDE_s.h>

// provides WebIf, need the structures & types ...
#include "WebIf_Module.h"

// this Modules structures & types ...
#include "ESP32_TouchGUI1_Module_s.h"
#include "ESP32_TouchGUI1_Module.h"
#include "tft.h"






#define DEG_TO_RAD 0.01745329252
#define RAD_TO_DEG 57.295779513
#define deg_to_rad 0.01745329252 + 3.14159265359
#define swap(a, b) { int16_t t = a; a = b; b = t; }
#define constrain(amt,low,high) ((amt)<(low)?(low):((amt)>(high)?(high):(amt)))
#if !defined(max)
#define max(A,B) ( (A) > (B) ? (A):(B))
#endif
#if !defined(min)
#define min(A,B) ( (A) < (B) ? (A):(B))
#endif

// Embedded fonts
extern uint8_t tft_SmallFont[];
extern uint8_t tft_DefaultFont[];
extern uint8_t tft_Dejavu18[];
extern uint8_t tft_Dejavu24[];
extern uint8_t tft_Ubuntu16[];
extern uint8_t tft_Comic24[];
extern uint8_t tft_minya24[];
extern uint8_t tft_tooney32[];
extern uint8_t tft_def_small[];

// ==== Color definitions constants ==============
const color_t TFT_BLACK       = {   0,   0,   0 };
const color_t TFT_NAVY        = {   0,   0, 128 };
const color_t TFT_DARKGREEN   = {   0, 128,   0 };
const color_t TFT_DARKCYAN    = {   0, 128, 128 };
const color_t TFT_MAROON      = { 128,   0,   0 };
const color_t TFT_PURPLE      = { 128,   0, 128 };
const color_t TFT_OLIVE       = { 128, 128,   0 };
const color_t TFT_LIGHTGREY   = { 192, 192, 192 };
const color_t TFT_DARKGREY    = { 128, 128, 128 };
const color_t TFT_BLUE        = {   0,   0, 255 };
const color_t TFT_GREEN       = {   0, 255,   0 };
const color_t TFT_CYAN        = {   0, 255, 255 };
const color_t TFT_RED         = { 252,   0,   0 };
const color_t TFT_MAGENTA     = { 252,   0, 255 };
const color_t TFT_YELLOW      = { 252, 252,   0 };
const color_t TFT_WHITE       = { 252, 252, 252 };
const color_t TFT_ORANGE      = { 252, 164,   0 };
const color_t TFT_GREENYELLOW = { 172, 252,  44 };
const color_t TFT_PINK        = { 252, 192, 202 };
// ===============================================

// ==============================================================
// ==== Set default values of global variables ==================
uint8_t orientation = LANDSCAPE;// screen orientation
uint16_t font_rotate = 0;		// font rotation
uint8_t	font_transparent = 0;
uint8_t	font_forceFixed = 0;
uint8_t	text_wrap = 0;			// character wrapping to new line
color_t	_fg = {  0, 255,   0};
color_t _bg = {  0,   0,   0};
uint8_t image_debug = 0;

float _angleOffset = DEFAULT_ANGLE_OFFSET;

int	TFT_X = 0;
int	TFT_Y = 0;

uint32_t tp_calx = 7472920;
uint32_t tp_caly = 122224794;

dispWin_t dispWin = {
  .x1 = 0,
  .y1 = 0,
  .x2 = DEFAULT_TFT_DISPLAY_WIDTH,
  .y2 = DEFAULT_TFT_DISPLAY_HEIGHT,
};

Font cfont = {
	.font = tft_DefaultFont,
	.x_size = 0,
	.y_size = 0x0B,
	.offset = 0,
	.numchars = 95,
	.bitmap = 1,
};

uint8_t font_buffered_char = 1;
uint8_t font_line_space = 0;
// ==============================================================


typedef struct {
      uint8_t charCode;
      int adjYOffset;
      int width;
      int height;
      int xOffset;
      int xDelta;
      uint16_t dataPtr;
} propFont;

static dispWin_t dispWinTemp;

static uint8_t *userfont = NULL;
static int TFT_OFFSET = 0;
static propFont	fontChar;
static float _arcAngleMax = DEFAULT_ARC_ANGLE_MAX;


// =========================================================================
// ** All drawings are clipped to 'dispWin' **
// ** All x,y coordinates in public functions are relative to clip window **
// =========== : Public functions
// ----------- : Local functions
// =========================================================================


// Compare two colors; return 0 if equal
//============================================
int TFT_compare_colors(color_t c1, color_t c2)
{
	if ((c1.r & 0xFC) != (c2.r & 0xFC)) return 1;
	if ((c1.g & 0xFC) != (c2.g & 0xFC)) return 1;
	if ((c1.b & 0xFC) != (c2.b & 0xFC)) return 1;

	return 0;
}

// draw color pixel on screen
//------------------------------------------------------------------------
static void 
_drawPixel(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
 	int16_t x,
 	int16_t y,
 	color_t color,
 	uint8_t sel) {

  if ((x < dispWin.x1) || (y < dispWin.y1) || (x > dispWin.x2) || (y > dispWin.y2)) return;

  drawPixel(ESP32_TouchGUI1_Definition, x, y, color, sel);
}



//====================================================================
void 
TFT_drawPixel(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
 	int16_t x,
 	int16_t y,
 	color_t color,
 	uint8_t sel) {

	_drawPixel(ESP32_TouchGUI1_Definition, x+dispWin.x1, y+dispWin.y1, color, sel);
}

//===========================================
color_t 
TFT_readPixel(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	int16_t x,
	int16_t y) {

  if ((x < dispWin.x1) || (y < dispWin.y1) || (x > dispWin.x2) || (y > dispWin.y2)) return TFT_BLACK;

  return readPixel(ESP32_TouchGUI1_Definition, x, y);
}

//--------------------------------------------------------------------------
static void _drawFastVLine(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	int16_t x,
	int16_t y,
	int16_t h,
	color_t color) {
  // clipping
  if ((x < dispWin.x1) || (x > dispWin.x2) || (y > dispWin.y2)) return;

  if (y < dispWin.y1) {

	h -= (dispWin.y1 - y);
	y = dispWin.y1;
  }

  if (h < 0) h = 0;

  if ((y + h) > (dispWin.y2+1)) h = dispWin.y2 - y + 1;

  if (h == 0) h = 1;

  TFT_pushColorRep(ESP32_TouchGUI1_Definition, x, y, x, y+h-1, color, (uint32_t)h);
}

