mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
//--------------------------------------------------------------------------
static void _drawFastHLine(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	int16_t x,
	int16_t y,
	int16_t w,
	color_t color)
{
	// clipping
	if ((y < dispWin.y1) || (x > dispWin.x2) || (y > dispWin.y2)) return;
	if (x < dispWin.x1) {
		w -= (dispWin.x1 - x);
		x = dispWin.x1;
	}
	if (w < 0) w = 0;
	if ((x + w) > (dispWin.x2+1)) w = dispWin.x2 - x + 1;
	if (w == 0) w = 1;

	TFT_pushColorRep(ESP32_TouchGUI1_Definition, x, y, x+w-1, y, color, (uint32_t)w);
}

//======================================================================
void TFT_drawFastVLine(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int16_t h, color_t color) {
	_drawFastVLine(ESP32_TouchGUI1_Definition, x+dispWin.x1, y+dispWin.y1, h, color);
}

//======================================================================
void TFT_drawFastHLine(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int16_t w, color_t color) {
	_drawFastHLine(ESP32_TouchGUI1_Definition, x+dispWin.x1, y+dispWin.y1, w, color);
}

// Bresenham's algorithm - thx wikipedia - speed enhanced by Bodmer this uses
// the eficient FastH/V Line draw routine for segments of 2 pixels or more
//----------------------------------------------------------------------------------
static void _drawLine(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x0, int16_t y0, int16_t x1, int16_t y1, color_t color)
{
  if (x0 == x1) {
	  if (y0 <= y1) _drawFastVLine(ESP32_TouchGUI1_Definition, x0, y0, y1-y0, color);
	  else _drawFastVLine(ESP32_TouchGUI1_Definition, x0, y1, y0-y1, color);
	  return;
  }
  if (y0 == y1) {
	  if (x0 <= x1) _drawFastHLine(ESP32_TouchGUI1_Definition, x0, y0, x1-x0, color);
	  else _drawFastHLine(ESP32_TouchGUI1_Definition, x1, y0, x0-x1, color);
	  return;
  }

  int steep = 0;
  if (abs(y1 - y0) > abs(x1 - x0)) steep = 1;
  if (steep) {
    swap(x0, y0);
    swap(x1, y1);
  }
  if (x0 > x1) {
    swap(x0, x1);
    swap(y0, y1);
  }

  int16_t dx = x1 - x0, dy = abs(y1 - y0);
  int16_t err = dx >> 1, ystep = -1, xs = x0, dlen = 0;

  if (y0 < y1) ystep = 1;

  // Split into steep and not steep for FastH/V separation
  if (steep) {
    for (; x0 <= x1; x0++) {
      dlen++;
      err -= dy;
      if (err < 0) {
        err += dx;
        if (dlen == 1) _drawPixel(ESP32_TouchGUI1_Definition, y0, xs, color, 1);
        else _drawFastVLine(ESP32_TouchGUI1_Definition, y0, xs, dlen, color);
        dlen = 0; y0 += ystep; xs = x0 + 1;
      }
    }
    if (dlen) _drawFastVLine(ESP32_TouchGUI1_Definition, y0, xs, dlen, color);
  }
  else
  {
    for (; x0 <= x1; x0++) {
      dlen++;
      err -= dy;
      if (err < 0) {
        err += dx;
        if (dlen == 1) _drawPixel(ESP32_TouchGUI1_Definition, xs, y0, color, 1);
        else _drawFastHLine(ESP32_TouchGUI1_Definition, xs, y0, dlen, color);
        dlen = 0; y0 += ystep; xs = x0 + 1;
      }
    }
    if (dlen) _drawFastHLine(ESP32_TouchGUI1_Definition, xs, y0, dlen, color);
  }
}

//==============================================================================
void TFT_drawLine(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x0, int16_t y0, int16_t x1, int16_t y1, color_t color)
{
	_drawLine(ESP32_TouchGUI1_Definition, x0+dispWin.x1, y0+dispWin.y1, x1+dispWin.x1, y1+dispWin.y1, color);
}

// fill a rectangle
//--------------------------------------------------------------------------------
static void _fillRect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int16_t w, int16_t h, color_t color) {
	// clipping
	if ((x >= dispWin.x2) || (y > dispWin.y2)) return;

	if (x < dispWin.x1) {
		w -= (dispWin.x1 - x);
		x = dispWin.x1;
	}
	if (y < dispWin.y1) {
		h -= (dispWin.y1 - y);
		y = dispWin.y1;
	}
	if (w < 0) w = 0;
	if (h < 0) h = 0;

	if ((x + w) > (dispWin.x2+1)) w = dispWin.x2 - x + 1;
	if ((y + h) > (dispWin.y2+1)) h = dispWin.y2 - y + 1;
	if (w == 0) w = 1;
	if (h == 0) h = 1;
	TFT_pushColorRep(ESP32_TouchGUI1_Definition, x, y, x+w-1, y+h-1, color, (uint32_t)(h*w));
}

//============================================================================
void TFT_fillRect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int16_t w, int16_t h, color_t color) {
	_fillRect(ESP32_TouchGUI1_Definition, x+dispWin.x1, y+dispWin.y1, w, h, color);
}

//==================================
void TFT_fillScreen(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, color_t color) {
	TFT_pushColorRep(ESP32_TouchGUI1_Definition, 0, 0, _width-1, _height-1, color, (uint32_t)(_height*_width));
}

//==================================
void TFT_fillWindow(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, color_t color) {
	TFT_pushColorRep(ESP32_TouchGUI1_Definition, dispWin.x1, dispWin.y1, dispWin.x2, dispWin.y2,
			color, (uint32_t)((dispWin.x2-dispWin.x1+1) * (dispWin.y2-dispWin.y1+1)));
}

// ^^^============= Basics drawing functions ================================^^^


// ================ Graphics drawing functions ==================================

//-----------------------------------------------------------------------------------
static void _drawRect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x1,uint16_t y1,uint16_t w,uint16_t h, color_t color) {
  _drawFastHLine(ESP32_TouchGUI1_Definition, x1,y1,w, color);
  _drawFastVLine(ESP32_TouchGUI1_Definition, x1+w-1,y1,h, color);
  _drawFastHLine(ESP32_TouchGUI1_Definition, x1,y1+h-1,w, color);
  _drawFastVLine(ESP32_TouchGUI1_Definition, x1,y1,h, color);
}

//===============================================================================
void TFT_drawRect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x1,uint16_t y1,uint16_t w,uint16_t h, color_t color) {
	_drawRect(ESP32_TouchGUI1_Definition, x1+dispWin.x1, y1+dispWin.y1, w, h, color);
}

//-------------------------------------------------------------------------------------------------
static void drawCircleHelper(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x0, int16_t y0, int16_t r, uint8_t cornername, color_t color)
{
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

	disp_select(ESP32_TouchGUI1_Definition);
	while (x < y) {
		if (f >= 0) {
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;
		if (cornername & 0x4) {
			_drawPixel(ESP32_TouchGUI1_Definition, x0 + x, y0 + y, color, 0);
			_drawPixel(ESP32_TouchGUI1_Definition, x0 + y, y0 + x, color, 0);
		}
		if (cornername & 0x2) {
			_drawPixel(ESP32_TouchGUI1_Definition, x0 + x, y0 - y, color, 0);
			_drawPixel(ESP32_TouchGUI1_Definition, x0 + y, y0 - x, color, 0);
		}
		if (cornername & 0x8) {
			_drawPixel(ESP32_TouchGUI1_Definition, x0 - y, y0 + x, color, 0);
			_drawPixel(ESP32_TouchGUI1_Definition, x0 - x, y0 + y, color, 0);
		}
		if (cornername & 0x1) {
			_drawPixel(ESP32_TouchGUI1_Definition, x0 - y, y0 - x, color, 0);
			_drawPixel(ESP32_TouchGUI1_Definition, x0 - x, y0 - y, color, 0);
		}
	}
	disp_deselect(ESP32_TouchGUI1_Definition);
}

// Used to do circles and roundrects
//----------------------------------------------------------------------------------------------------------------
static void fillCircleHelper(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x0, int16_t y0, int16_t r,	uint8_t cornername, int16_t delta, color_t color)
{
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;
	int16_t ylm = x0 - r;

