mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
	while (x < y) {
		if (f >= 0) {
			if (cornername & 0x1) _drawFastVLine(ESP32_TouchGUI1_Definition, x0 + y, y0 - x, 2 * x + 1 + delta, color);
			if (cornername & 0x2) _drawFastVLine(ESP32_TouchGUI1_Definition, x0 - y, y0 - x, 2 * x + 1 + delta, color);
			ylm = x0 - y;
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;

		if ((x0 - x) > ylm) {
			if (cornername & 0x1) _drawFastVLine(ESP32_TouchGUI1_Definition, x0 + x, y0 - y, 2 * y + 1 + delta, color);
			if (cornername & 0x2) _drawFastVLine(ESP32_TouchGUI1_Definition, x0 - x, y0 - y, 2 * y + 1 + delta, color);
		}
	}
}

// Draw a rounded rectangle
//=============================================================================================
void TFT_drawRoundRect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t r, color_t color)
{
	x += dispWin.x1;
	y += dispWin.y1;

	// smarter version
	_drawFastHLine(ESP32_TouchGUI1_Definition, x + r, y, w - 2 * r, color);			// Top
	_drawFastHLine(ESP32_TouchGUI1_Definition, x + r, y + h - 1, w - 2 * r, color);	// Bottom
	_drawFastVLine(ESP32_TouchGUI1_Definition, x, y + r, h - 2 * r, color);			// Left
	_drawFastVLine(ESP32_TouchGUI1_Definition, x + w - 1, y + r, h - 2 * r, color);	// Right

	// draw four corners
	drawCircleHelper(ESP32_TouchGUI1_Definition, x + r, y + r, r, 1, color);
	drawCircleHelper(ESP32_TouchGUI1_Definition, x + w - r - 1, y + r, r, 2, color);
	drawCircleHelper(ESP32_TouchGUI1_Definition, x + w - r - 1, y + h - r - 1, r, 4, color);
	drawCircleHelper(ESP32_TouchGUI1_Definition, x + r, y + h - r - 1, r, 8, color);
}

// Fill a rounded rectangle
//=============================================================================================
void TFT_fillRoundRect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t r, color_t color)
{
	x += dispWin.x1;
	y += dispWin.y1;

	// smarter version
	_fillRect(ESP32_TouchGUI1_Definition, x + r, y, w - 2 * r, h, color);

	// draw four corners
	fillCircleHelper(ESP32_TouchGUI1_Definition, x + w - r - 1, y + r, r, 1, h - 2 * r - 1, color);
	fillCircleHelper(ESP32_TouchGUI1_Definition, x + r, y + r, r, 2, h - 2 * r - 1, color);
}




//-----------------------------------------------------------------------------------------------
static void _drawLineByAngle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int16_t angle, uint16_t length, color_t color)
{
	_drawLine(ESP32_TouchGUI1_Definition, 
		x,
		y,
		x + length * cos((angle + _angleOffset) * DEG_TO_RAD),
		y + length * sin((angle + _angleOffset) * DEG_TO_RAD), color);
}

//---------------------------------------------------------------------------------------------------------------
static void _DrawLineByAngle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int16_t angle, uint16_t start, uint16_t length, color_t color)
{
	_drawLine(ESP32_TouchGUI1_Definition, 
		x + start * cos((angle + _angleOffset) * DEG_TO_RAD),
		y + start * sin((angle + _angleOffset) * DEG_TO_RAD),
		x + (start + length) * cos((angle + _angleOffset) * DEG_TO_RAD),
		y + (start + length) * sin((angle + _angleOffset) * DEG_TO_RAD), color);
}

//===========================================================================================================
void TFT_drawLineByAngle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x, uint16_t y, uint16_t start, uint16_t len, uint16_t angle, color_t color)
{
	x += dispWin.x1;
	y += dispWin.y1;

	if (start == 0) _drawLineByAngle(ESP32_TouchGUI1_Definition, x, y, angle, len, color);
	else _DrawLineByAngle(ESP32_TouchGUI1_Definition, x, y, angle, start, len, color);
}


// Draw a triangle
//--------------------------------------------------------------------------------------------------------------------
static void _drawTriangle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, color_t color)
{
	_drawLine(ESP32_TouchGUI1_Definition, x0, y0, x1, y1, color);
	_drawLine(ESP32_TouchGUI1_Definition, x1, y1, x2, y2, color);
	_drawLine(ESP32_TouchGUI1_Definition, x2, y2, x0, y0, color);
}

//================================================================================================================
void TFT_drawTriangle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, color_t color)
{
	x0 += dispWin.x1;
	y0 += dispWin.y1;
	x1 += dispWin.x1;
	y1 += dispWin.y1;
	x2 += dispWin.x1;
	y2 += dispWin.y1;

	_drawLine(ESP32_TouchGUI1_Definition, x0, y0, x1, y1, color);
	_drawLine(ESP32_TouchGUI1_Definition, x1, y1, x2, y2, color);
	_drawLine(ESP32_TouchGUI1_Definition, x2, y2, x0, y0, color);
}

// Fill a triangle
//--------------------------------------------------------------------------------------------------------------------
static void _fillTriangle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, color_t color)
{
  int16_t a, b, y, last;

  // Sort coordinates by Y order (y2 >= y1 >= y0)
  if (y0 > y1) {
    swap(y0, y1); swap(x0, x1);
  }
  if (y1 > y2) {
    swap(y2, y1); swap(x2, x1);
  }
  if (y0 > y1) {
    swap(y0, y1); swap(x0, x1);
  }

  if(y0 == y2) { // Handle awkward all-on-same-line case as its own thing
    a = b = x0;
    if(x1 < a)      a = x1;
    else if(x1 > b) b = x1;
    if(x2 < a)      a = x2;
    else if(x2 > b) b = x2;
    _drawFastHLine(ESP32_TouchGUI1_Definition, a, y0, b-a+1, color);
    return;
  }

  int16_t
    dx01 = x1 - x0,
    dy01 = y1 - y0,
    dx02 = x2 - x0,
    dy02 = y2 - y0,
    dx12 = x2 - x1,
    dy12 = y2 - y1;
  int32_t
    sa   = 0,
    sb   = 0;

  // For upper part of triangle, find scanline crossings for segments
  // 0-1 and 0-2.  If y1=y2 (flat-bottomed triangle), the scanline y1
  // is included here (and second loop will be skipped, avoiding a /0
  // error there), otherwise scanline y1 is skipped here and handled
  // in the second loop...which also avoids a /0 error here if y0=y1
  // (flat-topped triangle).
  if(y1 == y2) last = y1;   // Include y1 scanline
  else         last = y1-1; // Skip it

