mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
  for(y=y0; y<=last; y++) {
    a   = x0 + sa / dy01;
    b   = x0 + sb / dy02;
    sa += dx01;
    sb += dx02;
    /* longhand:
    a = x0 + (x1 - x0) * (y - y0) / (y1 - y0);
    b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
    */
    if(a > b) swap(a,b);
    _drawFastHLine(ESP32_TouchGUI1_Definition, a, y, b-a+1, color);
  }

  // For lower part of triangle, find scanline crossings for segments
  // 0-2 and 1-2.  This loop is skipped if y1=y2.
  sa = dx12 * (y - y1);
  sb = dx02 * (y - y0);
  for(; y<=y2; y++) {
    a   = x1 + sa / dy12;
    b   = x0 + sb / dy02;
    sa += dx12;
    sb += dx02;
    /* longhand:
    a = x1 + (x2 - x1) * (y - y1) / (y2 - y1);
    b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
    */
    if(a > b) swap(a,b);
    _drawFastHLine(ESP32_TouchGUI1_Definition, a, y, b-a+1, color);
  }
}

//================================================================================================================
void TFT_fillTriangle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, color_t color)
{
	_fillTriangle(ESP32_TouchGUI1_Definition, 
			x0 + dispWin.x1, y0 + dispWin.y1,
			x1 + dispWin.x1, y1 + dispWin.y1,
			x2 + dispWin.x1, y2 + dispWin.y1,
			color);
}

//====================================================================
void TFT_drawCircle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int radius, color_t color) {
	x += dispWin.x1;
	y += dispWin.y1;
	int f = 1 - radius;
	int ddF_x = 1;
	int ddF_y = -2 * radius;
	int x1 = 0;
	int y1 = radius;

	disp_select(ESP32_TouchGUI1_Definition);
	_drawPixel(ESP32_TouchGUI1_Definition, x, y + radius, color, 0);
	_drawPixel(ESP32_TouchGUI1_Definition, x, y - radius, color, 0);
	_drawPixel(ESP32_TouchGUI1_Definition, x + radius, y, color, 0);
	_drawPixel(ESP32_TouchGUI1_Definition, x - radius, y, color, 0);
	while(x1 < y1) {
		if (f >= 0) {
			y1--;
			ddF_y += 2;
			f += ddF_y;
		}
		x1++;
		ddF_x += 2;
		f += ddF_x;
		_drawPixel(ESP32_TouchGUI1_Definition, x + x1, y + y1, color, 0);
		_drawPixel(ESP32_TouchGUI1_Definition, x - x1, y + y1, color, 0);
		_drawPixel(ESP32_TouchGUI1_Definition, x + x1, y - y1, color, 0);
		_drawPixel(ESP32_TouchGUI1_Definition, x - x1, y - y1, color, 0);
		_drawPixel(ESP32_TouchGUI1_Definition, x + y1, y + x1, color, 0);
		_drawPixel(ESP32_TouchGUI1_Definition, x - y1, y + x1, color, 0);
		_drawPixel(ESP32_TouchGUI1_Definition, x + y1, y - x1, color, 0);
		_drawPixel(ESP32_TouchGUI1_Definition, x - y1, y - x1, color, 0);
	}
  disp_deselect(ESP32_TouchGUI1_Definition);
}

//====================================================================
void TFT_fillCircle(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int radius, color_t color) {
	x += dispWin.x1;
	y += dispWin.y1;

	_drawFastVLine(ESP32_TouchGUI1_Definition, x, y-radius, 2*radius+1, color);
	fillCircleHelper(ESP32_TouchGUI1_Definition, x, y, radius, 3, 0, color);
}

//----------------------------------------------------------------------------------------------------------------
static void _draw_ellipse_section(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x, uint16_t y, uint16_t x0, uint16_t y0, color_t color, uint8_t option)
{
	disp_select(ESP32_TouchGUI1_Definition);
    // upper right
    if ( option & TFT_ELLIPSE_UPPER_RIGHT ) _drawPixel(ESP32_TouchGUI1_Definition, x0 + x, y0 - y, color, 0);
    // upper left
    if ( option & TFT_ELLIPSE_UPPER_LEFT ) _drawPixel(ESP32_TouchGUI1_Definition, x0 - x, y0 - y, color, 0);
    // lower right
    if ( option & TFT_ELLIPSE_LOWER_RIGHT ) _drawPixel(ESP32_TouchGUI1_Definition, x0 + x, y0 + y, color, 0);
    // lower left
    if ( option & TFT_ELLIPSE_LOWER_LEFT ) _drawPixel(ESP32_TouchGUI1_Definition, x0 - x, y0 + y, color, 0);
	disp_deselect(ESP32_TouchGUI1_Definition);
}

//=====================================================================================================
void TFT_drawEllipse(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x0, uint16_t y0, uint16_t rx, uint16_t ry, color_t color, uint8_t option)
{
	x0 += dispWin.x1;
	y0 += dispWin.y1;

	uint16_t x, y;
	int32_t xchg, ychg;
	int32_t err;
	int32_t rxrx2;
	int32_t ryry2;
	int32_t stopx, stopy;

	rxrx2 = rx;
	rxrx2 *= rx;
	rxrx2 *= 2;

	ryry2 = ry;
	ryry2 *= ry;
	ryry2 *= 2;

	x = rx;
	y = 0;

	xchg = 1;
	xchg -= rx;
	xchg -= rx;
	xchg *= ry;
	xchg *= ry;

	ychg = rx;
	ychg *= rx;

	err = 0;

	stopx = ryry2;
	stopx *= rx;
	stopy = 0;

	while( stopx >= stopy ) {
		_draw_ellipse_section(ESP32_TouchGUI1_Definition, x, y, x0, y0, color, option);
		y++;
		stopy += rxrx2;
		err += ychg;
		ychg += rxrx2;
		if ( 2*err+xchg > 0 ) {
			x--;
			stopx -= ryry2;
			err += xchg;
			xchg += ryry2;
		}
	}

	x = 0;
	y = ry;

	xchg = ry;
	xchg *= ry;

	ychg = 1;
	ychg -= ry;
	ychg -= ry;
	ychg *= rx;
	ychg *= rx;

	err = 0;

	stopx = 0;

	stopy = rxrx2;
	stopy *= ry;

	while( stopx <= stopy ) {
		_draw_ellipse_section(ESP32_TouchGUI1_Definition, x, y, x0, y0, color, option);
		x++;
		stopx += ryry2;
		err += xchg;
		xchg += ryry2;
		if ( 2*err+ychg > 0 ) {
			y--;
			stopy -= rxrx2;
			err += ychg;
			ychg += rxrx2;
		}
	}
}

//-----------------------------------------------------------------------------------------------------------------------
static void _draw_filled_ellipse_section(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x, uint16_t y, uint16_t x0, uint16_t y0, color_t color, uint8_t option)
{
    // upper right
    if ( option & TFT_ELLIPSE_UPPER_RIGHT ) _drawFastVLine(ESP32_TouchGUI1_Definition, x0+x, y0-y, y+1, color);
    // upper left
    if ( option & TFT_ELLIPSE_UPPER_LEFT ) _drawFastVLine(ESP32_TouchGUI1_Definition, x0-x, y0-y, y+1, color);
    // lower right
    if ( option & TFT_ELLIPSE_LOWER_RIGHT ) _drawFastVLine(ESP32_TouchGUI1_Definition, x0+x, y0, y+1, color);
    // lower left
    if ( option & TFT_ELLIPSE_LOWER_LEFT ) _drawFastVLine(ESP32_TouchGUI1_Definition, x0-x, y0, y+1, color);
}

//=====================================================================================================
void TFT_fillEllipse(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t x0, uint16_t y0, uint16_t rx, uint16_t ry, color_t color, uint8_t option)
{
	x0 += dispWin.x1;
	y0 += dispWin.y1;

	uint16_t x, y;
	int32_t xchg, ychg;
	int32_t err;
	int32_t rxrx2;
	int32_t ryry2;
	int32_t stopx, stopy;

