mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
//----------------------------------------------------------------------------------------------
static void barHor(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int16_t w, int16_t l, color_t color, color_t outline) {
  _fillTriangle(ESP32_TouchGUI1_Definition, x+2*w, y+2*w-1, x+w+1, y+w, x+2*w, y+1, color);
  _fillTriangle(ESP32_TouchGUI1_Definition, x+2*w+l+1, y+2*w-1, x+3*w+l, y+w, x+2*w+l+1, y+1, color);
  _fillRect(ESP32_TouchGUI1_Definition, x+2*w+1, y, l, 2*w+1, color);
  if (cfont.offset) {
    _drawTriangle(ESP32_TouchGUI1_Definition, x+2*w, y+2*w-1, x+w+1, y+w, x+2*w, y+1, outline);
    _drawTriangle(ESP32_TouchGUI1_Definition, x+2*w+l+1, y+2*w-1, x+3*w+l, y+w, x+2*w+l+1, y+1, outline);
    _drawRect(ESP32_TouchGUI1_Definition, x+2*w+1, y, l, 2*w+1, outline);
  }
}

//--------------------------------------------------------------------------------------------
static void _draw7seg(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, int8_t num, int16_t w, int16_t l, color_t color) {
  /* TODO: clipping */
  if (num < 0x2D || num > 0x3A) return;

  int16_t c = font_bcd[num-0x2D];
  int16_t d = 2*w+l+1;

  // === Clear unused segments ===
  if (!(c & 0x001)) barVert(ESP32_TouchGUI1_Definition, x+d, y+d, w, l, _bg, _bg);
  if (!(c & 0x002)) barVert(ESP32_TouchGUI1_Definition, x,   y+d, w, l, _bg, _bg);
  if (!(c & 0x004)) barVert(ESP32_TouchGUI1_Definition, x+d, y, w, l, _bg, _bg);
  if (!(c & 0x008)) barVert(ESP32_TouchGUI1_Definition, x,   y, w, l, _bg, _bg);
  if (!(c & 0x010)) barHor(ESP32_TouchGUI1_Definition, x, y+2*d, w, l, _bg, _bg);
  if (!(c & 0x020)) barHor(ESP32_TouchGUI1_Definition, x, y+d, w, l, _bg, _bg);
  if (!(c & 0x040)) barHor(ESP32_TouchGUI1_Definition, x, y, w, l, _bg, _bg);

  if (!(c & 0x080)) {
    // low point
    _fillRect(ESP32_TouchGUI1_Definition, x+(d/2), y+2*d, 2*w+1, 2*w+1, _bg);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+(d/2), y+2*d, 2*w+1, 2*w+1, _bg);
  }
  if (!(c & 0x100)) {
    // down middle point
    _fillRect(ESP32_TouchGUI1_Definition, x+(d/2), y+d+2*w+1, 2*w+1, l/2, _bg);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+(d/2), y+d+2*w+1, 2*w+1, l/2, _bg);
  }
  if (!(c & 0x800)) {
	// up middle point
    _fillRect(ESP32_TouchGUI1_Definition, x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, _bg);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, _bg);
  }
  if (!(c & 0x200)) {
    // middle, minus
    _fillRect(ESP32_TouchGUI1_Definition, x+2*w+1, y+d, l, 2*w+1, _bg);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+2*w+1, y+d, l, 2*w+1, _bg);
  }

  // === Draw used segments ===
  if (c & 0x001) barVert(ESP32_TouchGUI1_Definition, x+d, y+d, w, l, color, cfont.color);	// down right
  if (c & 0x002) barVert(ESP32_TouchGUI1_Definition, x,   y+d, w, l, color, cfont.color);	// down left
  if (c & 0x004) barVert(ESP32_TouchGUI1_Definition, x+d, y, w, l, color, cfont.color);		// up right
  if (c & 0x008) barVert(ESP32_TouchGUI1_Definition, x,   y, w, l, color, cfont.color);		// up left
  if (c & 0x010) barHor(ESP32_TouchGUI1_Definition, x, y+2*d, w, l, color, cfont.color);	// down
  if (c & 0x020) barHor(ESP32_TouchGUI1_Definition, x, y+d, w, l, color, cfont.color);		// middle
  if (c & 0x040) barHor(ESP32_TouchGUI1_Definition, x, y, w, l, color, cfont.color);		// up

  if (c & 0x080) {
    // low point
    _fillRect(ESP32_TouchGUI1_Definition, x+(d/2), y+2*d, 2*w+1, 2*w+1, color);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+(d/2), y+2*d, 2*w+1, 2*w+1, cfont.color);
  }
  if (c & 0x100) {
    // down middle point
    _fillRect(ESP32_TouchGUI1_Definition, x+(d/2), y+d+2*w+1, 2*w+1, l/2, color);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+(d/2), y+d+2*w+1, 2*w+1, l/2, cfont.color);
  }
  if (c & 0x800) {
	// up middle point
    _fillRect(ESP32_TouchGUI1_Definition, x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, color);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, cfont.color);
  }
  if (c & 0x200) {
    // middle, minus
    _fillRect(ESP32_TouchGUI1_Definition, x+2*w+1, y+d, l, 2*w+1, color);
    if (cfont.offset) _drawRect(ESP32_TouchGUI1_Definition, x+2*w+1, y+d, l, 2*w+1, cfont.color);
  }
}
//==============================================================================

//======================================
void TFT_print(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, char *st, int x, int y) {
	int stl, i, tmpw, tmph, fh;
	uint8_t ch;

	if (cfont.bitmap == 0) return; // wrong font selected

	// ** Rotated strings cannot be aligned
	if ((font_rotate != 0) && ((x <= CENTER) || (y <= CENTER))) return;

	if ((x < LASTX) || (font_rotate == 0)) TFT_OFFSET = 0;

	if ((x >= LASTX) && (x < LASTY)) x = TFT_X + (x-LASTX);
	else if (x > CENTER) x += dispWin.x1;

	if (y >= LASTY) y = TFT_Y + (y-LASTY);
	else if (y > CENTER) y += dispWin.y1;

	// ** Get number of characters in string to print
	stl = strlen(st);

	// ** Calculate CENTER, RIGHT or BOTTOM position
	tmpw = TFT_getStringWidth(st);	// string width in pixels
	fh = cfont.y_size;			// font height
	if ((cfont.x_size != 0) && (cfont.bitmap == 2)) {
		// 7-segment font
		fh = (3 * (2 * cfont.y_size + 1)) + (2 * cfont.x_size);  // 7-seg character height
	}

	if (x == RIGHT) x = dispWin.x2 - tmpw + dispWin.x1;
	else if (x == CENTER) x = (((dispWin.x2 - dispWin.x1 + 1) - tmpw) / 2) + dispWin.x1;

	if (y == BOTTOM) y = dispWin.y2 - fh + dispWin.y1;
	else if (y==CENTER) y = (((dispWin.y2 - dispWin.y1 + 1) - (fh/2)) / 2) + dispWin.y1;

	if (x < dispWin.x1) x = dispWin.x1;
	if (y < dispWin.y1) y = dispWin.y1;
	if ((x > dispWin.x2) || (y > dispWin.y2)) return;

	TFT_X = x;
	TFT_Y = y;

	// ** Adjust y position
	tmph = cfont.y_size; // font height
	// for non-proportional fonts, char width is the same for all chars
	tmpw = cfont.x_size;
	if (cfont.x_size != 0) {
		if (cfont.bitmap == 2) {	// 7-segment font
			tmpw = _7seg_width();	// character width
			tmph = _7seg_height();	// character height
		}
	}
	else TFT_OFFSET = 0;	// fixed font; offset not needed

	if ((TFT_Y + tmph - 1) > dispWin.y2) return;

	int offset = TFT_OFFSET;

	for (i=0; i<stl; i++) {
		ch = st[i]; // get string character

		if (ch == 0x0D) { // === '\r', erase to eol ====
			if ((!font_transparent) && (font_rotate==0)) _fillRect(ESP32_TouchGUI1_Definition, TFT_X, TFT_Y,  dispWin.x2+1-TFT_X, tmph, _bg);
		}

		else if (ch == 0x0A) { // ==== '\n', new line ====
			if (cfont.bitmap == 1) {
				TFT_Y += tmph + font_line_space;
				if (TFT_Y > (dispWin.y2-tmph)) break;
				TFT_X = dispWin.x1;
			}
		}

		else { // ==== other characters ====
			if (cfont.x_size == 0) {
				// for proportional font get character data to 'fontChar'
				if (getCharPtr(ch)) tmpw = fontChar.xDelta;
				else continue;
			}

